"""
Задание №1

На вход подается 1 строка без пробелов.
По данной строке определите, является ли она палиндромом
(то есть, можно ли прочесть ее наоборот, как, например,
слово "шалаш"). Необходимо вывести ”yes”, если строка
является палиндромом, и “no” в противном случае.
"""

# tmp = input('На вход подается 1 строка без пробелов: ')
# while tmp.count(' ') >= 1:
#     tmp = input('На вход подается 1 строка без пробелов: ')
# if tmp == tmp[::-1]:
#     print('yes')
# else:
#     print('no')


"""
Задание №2

Дана строка, длина которой не превосходит 1000.
Вам требуется преобразовать все идущие подряд пробелы в один.
Выведите измененную строку.
"""

# tmp = input("Введите строку не длинее 1000 символов: ")
# while len(tmp) > 1000:
#     tmp = input("Введите строку не длинее 1000 символов: ")
# print(' '.join(tmp.split()))

